[
    {
        "id": "1",
        "blogImage": "http://www.inceptapharma.com/products/1556792545_1_Polysoft_Main.jpg",
        "blogName": "Polysoft(Absorbable Synthetic Multifilament, Polyglactin 910 (Violet))",
        "blogDetails": "Coated Polysoft suture elicits a minimal acute inflammatory reaction in tissue and ingrowth of fibrous connective tissue. Progressive loss of tensile strength and eventual absorption of this suture occurs by means of hydrolysis where the copolymer degrades to glycolic and lactic acids which are subsequently absorbed and metabolized in the body. Absorption begins as a loss of tensile strength followed by a loss of mass."
    },
    {
        "id": "2",
        "blogImage": "http://www.inceptapharma.com/products/1556792572_1_Polysoft_Anti_B_Main.jpg",
        "blogName": "Polysoft Anti-B(Absorbable Synthetic Multifilament, Polyglactin 910 (Violet))",
        "blogDetails": "Coated Polysoft Anti-B (Polyglactin 910 Antibacterial) is a synthetic absorbable sterile surgical suture, composed of a copolymer made from 90% glycolide and 10% L-lactide. This suture is coated with a mixture composed of equal parts of a copolymer of glycolide and lactide (Polyglactin 370) and calcium stearate. The suture contains Irgacare MP (triclosan), a broad-spectrum antibacterial agent at no more than 472ug/m. The copolymers in this product have been found to be nonantigenic, nonpyrogenic and elicit only a mild tissue reaction during absorption."
    },
    {
        "id": "3",
        "blogImage": "http://www.inceptapharma.com/products/Reservix%20SR.jpg",
        "blogName": "Therapeutic Group: Analgesic, Anti Inflammatory",
        "blogDetails": "Reservix is a non-steroidal agent with antiinflammatory and analgesic properties. Its mode of action is largely based on inhibition of prostaglandin synthesis. Reservix is a potent inhibitor of the enzyme cyclooxygenase, which is involved in the production of prostaglandins. It also stimulates cartilage matrix (glycosaminoglycans) synthesis."
    },
    {
        "id": "4",
        "blogImage": "http://www.inceptapharma.com/products/Reservix%20SR.jpg",
        "blogName": "Therapeutic Group: Analgesic, Anti Inflammatory",
        "blogDetails": "Reservix is a non-steroidal agent with antiinflammatory and analgesic properties. Its mode of action is largely based on inhibition of prostaglandin synthesis. Reservix is a potent inhibitor of the enzyme cyclooxygenase, which is involved in the production of prostaglandins. It also stimulates cartilage matrix (glycosaminoglycans) synthesis."
    },
    {
        "id": "5",
        "blogImage": "http://www.inceptapharma.com/products/Infovir%2020.jpg",
        "blogName": "Infovir(Adefovir Dipivoxil)",
        "blogDetails": "Adefovir is an acyclic nucleotide analogue of adenosine monophosphate. Adefovir is phosphorylated to the active metabolite, Adefovir diphosphate, by cellular kinases. Adefovir diphosphate inhibits HBV DNA polymerase (reverse transcriptase) by competing with the natural substrate deoxyadenosine triphosphate and by causing DNA chain termination after its incorporation into viral DNA."
    },
    {
        "id": "6",
        "blogImage": "http://www.inceptapharma.com/products/Infovir%2020.jpg",
        "blogName": "Amlosartan(Amlodipine & Valsartan)",
        "blogDetails": "Amlodipine is a dihydropyridine calcium channel blocker that inhibits the transmembrane influx of calcium ions into vascular smooth muscle and cardiac muscle. Amlodipine has a greater effect on vascular smooth muscle cells than on cardiac muscle cells. Amlodipine is a peripheral arterial vasodilator that acts directly on vascular smooth muscle to cause a reduction in peripheral vascular resistance and reduction in blood pressure."
    },
    {
        "id": "7",
        "blogImage": "http://www.inceptapharma.com/products/Emestop%20Tab.jpg",
        "blogName": "Emestop(Aprepitant)",
        "blogDetails": "Aprepitant is a selective high affinity antagonist of human substance P neurokinin 1 (NK1) receptors. When substance P attaches to these receptors, it causes nausea and vomiting. Aprepitant stops substance P from binding to the NK1 receptors. By blocking the receptors, Aprepitant can prevent nausea and vomiting, which often happens after chemotherapy or as a complication of surgery."
    },
    {
        "id": "8",
        "blogImage": "http://www.inceptapharma.com/products/Aripra%2010.jpg",
        "blogName": "Aripra(Aripiprazole)",
        "blogDetails": "Aripra (Aripiprazole) is an atypical antipsychotic that has both dopamine and serotonin receptors activity. It is a partial agonist of dopamine D2 receptors that relieves the symptoms of schizophrenia. It is characterized as a dopamine system stabilizer. It is a potent partial agonist at serotonin 5-HT1A receptors and antagonist at 5-HT2A receptors. This is associated with improvement of depressive, cognitive and negative symptoms."
    },
    {
        "id": "9",
        "blogImage": "http://www.inceptapharma.com/products/Amlotab.jpg",
        "blogName": "Amlotab(Amlodipine)",
        "blogDetails": "Amlodipine is a Dihydropyridine Calcium antagonist that inhibits the transmembrane influx of Calcium ions into cardiac and vascular smooth muscle. It has greater affinity towards vascular smooth muscle than on cardiac muscle. Amlodipine is peripheral vasodilator that acts directly on vascular smooth muscle to cause a reduction in peripheral vascular resistance and thereby reduces blood pressure. Amlodipine reduces tone, decreases coronary vasoreactivity and lowers cardiac oxygen demand by reducing after load."
    },
    {
        "id": "10",
        "blogImage": "http://www.inceptapharma.com/products/Azonam%20Inj.jpg",
        "blogName": "Azonam 1g IM/IV injection: Each vial contains Aztreonam 1 gm as Aztreonam for Injection (Sterile) USP.",
        "blogDetails": "Aztreonam is a synthetic bactericidal monobactam antibiotic. It inhibits bacterial cell wall synthesis by blocking peptidoglycan crosslinking. The inhibition of bacterial cell wall synthesis occurs due to a high affinity of Aztreonam for penicillin binding protein 3 (PBP3). By binding to PBP3, Aztreonam inhibits the third and last stage of bacterial cell wall synthesis. Cell lysis is then mediated by bacterial cell wall autolytic enzymes such as autolysins. It is possible that Aztreonam interferes with an autolysin inhibitor."
    },
    {
        "id": "11",
        "blogImage": "http://www.inceptapharma.com/products/Azta%20Capsule%20copy.jpg",
        "blogName": "Each capsule contains Astaxanthin INN 4mg",
        "blogDetails": "Astaxanthin acts as an antioxidant by dual mode of action. It suppresses singlet oxygen and also inhibits lipid peroxidation. By these actions it reduces the harmful free radicals. Therefore acts as a very strong antioxidant. Astaxanthin is absorbed by passive diffusion into the intestinal epithelium alongside fatty acids. Then it is incorporated into lipoproteins, transported to the liver, via lymph and blood and partly resecreted with lipoproteins. More than 70% of the Astaxanthin is contained in high-density lipoprotein part of plasma. Highest concentration of Astaxanthin is in the small intestine, followed by subcutaneous fat, spleen, liver, heart, kidney and skin and lowest in the muscles."
    },
    {
        "id": "12",
        "blogImage": "http://www.inceptapharma.com/products/Tiginor-20.jpg",
        "blogName": "Tiginor 10 : Each tablet contains Atorvastatin Calcium Trihydrate INN equivalent to Atorvastatin 10 mg.",
        "blogDetails": "Tiginor (atorvastatin) is a synthetic lipid-lowering agent. Atorvastatin is an inhibitor of 3-hydroxy-3-methyl-glutaryl-coenzyme A (HMG-CoA) reductase. This enzyme catalyzes the conversion of HMG-CoA to mevalonate, an early and rate-limiting step in cholesterol biosynthesis."
    }  
    
]